Repository: Archichil/UniWeather
Catalog: UniWeather/Localizable.xcstrings
Source language: en
Languages: ru

# airQualityBar.harmful
source: Harmful
ru: Вредное

# airQualityBar.hazardous
source: Hazardous
ru: Очень вредное

# airQualityBar.low
source: Low
ru: Низкое

# airQualityBar.moderate
source: Moderate
ru: Умеренное

# airQualityBar.unhealthy
source: Unhealthy
ru: Нездоровое

# airQualityBar.veryLow
source: Very Low
ru: Очень низкое

# airQualitySection.level
source: level
ru: уровень

# airQualitySection.sectionName
source: AIR POLLUTION
ru: ЗАГРЯЗНЕНИЕ ВОЗДУХА

# airQualitySection.unknown
source: Unknown
ru: Неизвестно

# aiView.greeting
source: Hello, how can I help you today?
ru: Привет, чем я могу быть полезен сегодня?

# aiView.navigationTitle
source: AI Assistant
ru: ИИ-Ассистент

# aiViewModel.answerFetchingError
source: An error occurred while generating the response!
ru: Произошла ошибка при формировании ответа!

# aiViewModel.answerSendingError
source: An error occurred while sending!
ru: Произошла ошибка при отправке!

# aiViewModel.typing
source: Typing
ru: Думает

# chat.emptyDialog
source: The dialog is empty. You can choose the prompt below!
ru: Диалог пуст. Вы можете выбрать промпт ниже!

# chat.lastUpdatedPrefix
source: Last updated
ru: Последнее обновление

# chat.noPreviousMessage
source: No messages
ru: Нет сообщений

# compassWind.east
source: E
ru: З

# compassWind.north
source: N
ru: C

# compassWind.south
source: S
ru: Ю

# compassWind.unit
source: km/h
ru: км/ч

# compassWind.west
source: W
ru: В

# contentView.waitingText
source: Getting your location...
ru: Определяем ваше местоположение...

# datepicker.continueButton
source: Continue
ru: Продолжить

# datepicker.title
source: Choose the date
ru: Выберите дату

# datepicker.today
source: Today
ru: Сегодня

# datepicker.tomorrow
source: Tomorrow
ru: Завтра

# forecastPlayerView.frameTitle
source: 24-Hour Forecast
ru: Прогноз на 24 часа

# forecastPlayerView.timeDecrement
source: -3h
ru: -3ч

# forecastPlayerView.timeIncrement
source: +3h
ru: +3ч

# holidaysForecast.noData
source: No data
ru: Нет данных

# hourlyForecastSection.now
source: Now
ru: Сейчас

# hourlyForecastSection.sectionName
source: HOURLY FORECAST
ru: ПОЧАСОВОЙ ПРОГНОЗ

# hourlyForecastSection.sunrise
source: Sunrise
ru: Восход

# hourlyForecastSection.sunset
source: Sunset
ru: Закат

# humiditySection.dewPoint
source: Dew Point
ru: Точка росы

# humiditySection.sectionName
source: HUMIDITY
ru: ВЛАЖНОСТЬ

# locationItem.max
source: Max
ru: Макс

# locationItem.min
source: Min
ru: Мин

# locationItem.unknown
source: Unknown
ru: Неизвестно

# locationSearchView.navigationTitle
source: Search
ru: Поиск

# locationSearchView.searchPrompt
source: Search for a city or airport
ru: Введите город или аэропорт

# prompt.buttonTitle
source: Check other prompts...
ru: Попробуйте другие промпты…

# prompt.enjoyableActivities
source: What enjoyable activities are perfect for this weather?
ru: Какие развлечения идеально подходят для такой погоды?

# prompt.exploreNearby
source: Where to explore based on the weather?
ru: Куда отправиться в зависимости от погоды?

# prompt.healthTips
source: Health tips for staying comfortable.
ru: Советы по сохранению здоровья.

# prompt.transportOption
source: Which transport option suits the weather?
ru: Какой вид транспорта подходит для погоды?

# prompt.whatToWear
source: What to wear for outdoor activities?
ru: Что надеть для активного отдыха?

# temperatureFeelsLikeSection.actually
source: Actual
ru: Фактически

# temperatureFeelsLikeSection.dewPoint
source: Dew Point Now
ru: Точка росы сейчас

# temperatureFeelsLikeSection.sectionName
source: FEELS LIKE
ru: ОЩУЩЕНИЕ

# texts.holidayForecast
source: Holiday Forecast
ru: Праздничный прогноз

# texts.holidayForecastDescription
source: Weather forecast for upcoming holidays
ru: Прогноз погоды на ближайшие праздники

# texts.holidaysNotFound
source: No upcoming holidays found!
ru: Ближайших праздников не найдено!

# texts.navigationTitle
source: Holiday Forecast
ru: Праздничный прогноз

# texts.noMarks
source: No notes
ru: Нет заметок

# weatherInfoView.max
source: Max
ru: Макс

# weatherInfoView.min
source: Min
ru: Мин

# weatherInfoView.unknown
source: Unknown
ru: Неизвестно

# weatherMapConfiguration.mapLayer.accumulatedPrecipitation.displayName
source: Accumulated precipitation
ru: Суммарные осадки

# weatherMapConfiguration.mapLayer.accumulatedPrecipitation.measurementValue
source: Accumulated precipitation (all), mm
ru: Осадки (все), мм

# weatherMapConfiguration.mapLayer.accumulatedPrecipitationRain.displayName
source: Accumulated precipitation - rain
ru: Суммарные осадки — дождь

# weatherMapConfiguration.mapLayer.accumulatedPrecipitationRain.measurementValue
source: Accumulated precipitation (rain), mm
ru: Осадки (дождь), мм

# weatherMapConfiguration.mapLayer.accumulatedPrecipitationSnow.displayName
source: Accumulated precipitation - snow
ru: Суммарные осадки — снег

# weatherMapConfiguration.mapLayer.accumulatedPrecipitationSnow.measurementValue
source: Accumulated precipitation (snow), mm
ru: Осадки (снег), мм

# weatherMapConfiguration.mapLayer.airTemperatureTwoMetersAltitude.displayName
source: Temperature (2m)
ru: Температура (2м)

source: Temperature, °C
ru: Температура, °C

# weatherMapConfiguration.mapLayer.atmosphericPressureSeaLevel.displayName
source: Atmospheric pressure (sea level)
ru: Давление (уровень моря)

# weatherMapConfiguration.mapLayer.atmosphericPressureSeaLevel.measurementValue
source: Pressure, Pa
ru: Давление, Па

# weatherMapConfiguration.mapLayer.clouds.displayName
source: Cloudiness
ru: Облачность

# weatherMapConfiguration.mapLayer.clouds.measurementValue
source: Cloudiness, %
ru: Облачность, %

# weatherMapConfiguration.mapLayer.convectivePrecipitation.displayName
source: Convective precipitation
ru: Конвективные осадки

# weatherMapConfiguration.mapLayer.convectivePrecipitation.measurementValue
source: Precipitation, mm
ru: Осадки, мм

# weatherMapConfiguration.mapLayer.dewPointTemperature.displayName
source: Dew point temp
ru: Точка росы

# weatherMapConfiguration.mapLayer.dewPointTemperature.measurementValue
source: Temperature, °C
ru: Температура, °C

# weatherMapConfiguration.mapLayer.precipitationIntensity.displayName
source: Precipitation intensity
ru: Интенсивность осадков

# weatherMapConfiguration.mapLayer.precipitationIntensity.measurementValue
source: Precipitation intensity, mm/s
ru: Интенсивность осадков, мм/с

# weatherMapConfiguration.mapLayer.relativeHumidity.displayName
source: Relative humidity
ru: Влажность

# weatherMapConfiguration.mapLayer.relativeHumidity.measurementValue
source: Humidity, %
ru: Влажность, %

# weatherMapConfiguration.mapLayer.snowDepth.displayName
source: Depth of snow
ru: Высота снежного покрова

# weatherMapConfiguration.mapLayer.snowDepth.measurementValue
source: Snow depth, m
ru: Глубина снега, м

# weatherMapConfiguration.mapLayer.soilTemperatureTenCmDepth.displayName
source: Soil temp >10 cm (K)
ru: Температура почвы >10 см (K)

# weatherMapConfiguration.mapLayer.soilTemperatureTenCmDepth.measurementValue
source: Temperature, K
ru: Температура, K

# weatherMapConfiguration.mapLayer.soilTemperatureZeroDepth.displayName
source: Soil temp 0 cm (K)
ru: Температура почвы 0 см (K)

# weatherMapConfiguration.mapLayer.soilTemperatureZeroDepth.measurementValue
source: Temperature, K
ru: Температура, K

# weatherMapConfiguration.mapLayer.wind.displayName
source: Wind Direction + Speed
ru: Направление и скорость ветра

# weatherMapConfiguration.mapLayer.wind.measurementValue
source: Wind speed, m/s
ru: Скорость ветра, м/с

# weatherMapConfiguration.mapLayer.windSpeedTenMetersAltitude.displayName
source: Wind Speed
ru: Скорость ветра

# weatherMapConfiguration.mapLayer.windSpeedTenMetersAltitude.measurementValue
source: Wind speed, m/s
ru: Скорость ветра, м/с

# weatherMapContainerView.ready
source: Ready
ru: Готово

# weekForecastSection.sectionName
source: 14-DAY FORECAST
ru: ПРОГНОЗ НА 14 ДНЕЙ

# weekForecastSection.today
source: Today
ru: Сегодня

# windSection.compass.east
source: E
ru: В

# windSection.compass.north
source: N
ru: С

# windSection.compass.northEast
source: NE
ru: СВ

# windSection.compass.northWest
source: NW
ru: СЗ

# windSection.compass.south
source: S
ru: Ю

# windSection.compass.southEast
source: SE
ru: ЮВ

# windSection.compass.southWest
source: SW
ru: ЮЗ

# windSection.compass.west
source: W
ru: З

# windSection.direction
source: Direction
ru: Направление

# windSection.gust
source: Wind Gusts
ru: Порывы ветра

# windSection.sectionName
source: WIND
ru: ВЕТЕР

# windSection.speedUnits
source: m/s
ru: м/с

# windSection.sunrise
source: Sunrise
ru: Восход

# windSection.sunset
source: Sunset
ru: Закат

# windSection.wind
source: Wind
ru: Ветер
